//not yet 5, 2, 4 ;done 1, 6, 3
//////////////////////////////zadanie 1///////////////////////////////////
//1: Выведите столбец чисел от 11 до 33.

/*for (let i = 11; i<=33; i++ ) {
	console.log(i)
}*/

//////////////////////////////zadanie 3///////////////////////////////////
//3: С помощью цикла найдите сумму чисел от 1 до 100.
/*let sum = 0

for (i = 1; i <=100; i++) {
	console.log(sum +=i)
}
*/

//////////////////////////////zadanie 5///////////////////////////////////
//5. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'.

/*let elements = [
	1, 2, 3, 4, 5, 6, 7, 8, 9
]

for ( i = 0; i <= 9; i++) {
	console.log(` ${(elements[i])}`)
}
*/

//////////////////////////////zadanie 6///////////////////////////////////
/*const users = [
	{ name: 'Bakyt', age: 17, job: 'Student' },
	{ name: 'Erjan', age: 21, job: 'Student' },
	{ name: 'Gulzada', age: 18, job: 'Student' },
	{ name: 'Aizada', age: 20, job: 'Student' },
]

for (i = 0; i < users.length; i++) {
users[i].age >= 18 ? console.log(`${users[i].name} Совершеннолетний!`) : null;
}
*/
